Repository: TetianaNieizviestna/NumerologySimpleApp
Catalog: NumerologyApp/Helpers/Localization/*.lproj/Localizable.strings
Languages: ru, uk_ua

# Global.error
source: Error
ru: Ошибка
uk_ua: Помилка

# Global.InsertText
source: Insert the text:
ru: Введите текст:
uk_ua: Введіть текст:

# Global.Result
source: Result
ru: Результат
uk_ua: Результат

# Global.Calculate
source: Calculate
ru: Рассчитать
uk_ua: Розрахувати

# Global.Info
source: Info
ru: Информация
uk_ua: Інформація

# Global.AppInfoText
source: How are numbers calculated in numerology? To find out the meaning of numbers of any size, the method of addition (numerological reduction) is used. This technique of reducing complex to simple helps to reduce all digital values ​​​​to simple numbers from 1 to 9. It is based on the principle that elementary numbers are the initial elements that can express the entire numerical variety. For example, after making two consecutive additions, the number 88357 turns into the number 31, and then into the number 4. STEP 1. 88357 → 88357 → 8 + 8 + 3 + 5 + 7 = 31 STEP 2. 31 → 3 + 1 = 4 When performing the reduction, you must constantly keep in mind one important rule: if at one of the steps you get a combination of numbers 11, 22, 13, 14, 16 or 19, then further reduction is not necessary. You have received a special number.
ru: Как производится расчет чисел в нумерологии? Чтобы выяснить значение чисел любой величины, применяется метод сложения (нумерологической редукции). Эта методика приведения сложного к простому помогает сокращать все цифровые значения до простых чисел от 1 до 9. В ее основе лежит принцип, говорящий о том, что элементарные цифры - это исходные элементы, которыми можно выразить все числовое многообразие. Например, произведя последовательно два сложения, число 88357 превращается в число 31, а затем в цифру 4. ШАГ 1. 88357 → 88357 → 8 + 8 + 3 + 5 + 7 = 31 ШАГ 2. 31 → 3 + 1 = 4 Выполняя редукцию необходимо постоянно держать в уме одно важное правило: если на одном из шагов у вас получилось сочетание цифр 11, 22, 13, 14, 16 или 19 то дальнейшее сокращение производить не нужно. Вы получили особенное число.
uk_ua: Як проводиться розрахунок чисел у нумерології? Щоб з'ясувати значення чисел будь-якої величини, застосовується метод додавання (нумерологічної редукції). Ця методика приведення складного до простого допомагає скорочувати всі цифрові значення до простих чисел від 1 до 9. В її основі лежить принцип, що говорить про те, що елементарні цифри - це вихідні елементи, якими можна виразити все числове різноманіття. Наприклад, зробивши послідовно дві додавання, число 88357 перетворюється на число 31, а потім на цифру 4. КРОК 1. 88357 → 88357 → 8 + 8 + 3 + 5 + 7 = 31 КРОК 2. 31 → 3 + 1 = 4 Виконуючи редукцію необхідно постійно пам'ятати одне важливе правило: якщо на одному з кроків у вас вийшло поєднання цифр 11, 22, 13, 14, 16 або 19, то подальше скорочення робити не потрібно. Ви отримали особливе число.

# Numerology.IncorrectAlgorythm
source: Incorrect algorythm!
ru: Некорректный алгоритм.
uk_ua: Некоректний алгоритм.

# Numerology.Description_0
source: Represents absolute nothingness, the non-manifestation of matter.
ru: Олицетворяет абсолютное небытие, непроявленность материи.
uk_ua: Втілює абсолютне небуття, непроявленість матерії.

# Numerology.Description_1
source: Power, might, courage, bravery, vitality.
ru: Власть, могущество, мужество, отвага, жизненная стойкость.
uk_ua: Влада, могутність, мужність, відвага, життєва стійкість.

# Numerology.Description_2
source: Grace, femininity, delicacy, flexibility, partnership.
ru: Изящество, женственность, деликатность, гибкость, партнерство.
uk_ua: Вишуканість, жіночність, делікатність, гнучкість, партнерство.

# Numerology.Description_3
source: Fantasy, creativity; a lifestyle characteristic of a "star".
ru: Фантазия, творчество; образ жизни, характерный для «звезды».
uk_ua: Фантазія, творчість; спосіб життя, характерний для "зірки".

# Numerology.Description_4
source: Stability, consistency, work, patience, organization.
ru: Устойчивость, последовательность, труд, терпение, организованность.
uk_ua: Стійкість, послідовність, праця, терпіння, організованість.

# Numerology.Description_5
source: Mobility, variability, change of place, curiosity, sensation.
ru: Мобильность, изменчивость, перемена мест, любознательность, сенсация.
uk_ua: Мобільність, мінливість, зміна місць, допитливість, сенсація.

# Numerology.Description_6
source: Harmony, tranquility, romance, family hearth.
ru: Гармоничность, спокойствие, романтика, семейный очаг.
uk_ua: Гармонічність, спокій, романтика, сімейне вогнище.

# Numerology.Description_7
source: The path of the explorer, the philosophical mindset, introspection.
ru: Путь исследователя, философский склад ума, самоанализ.
uk_ua: Шлях дослідника, філософський склад розуму, самоаналіз.

# Numerology.Description_8
source: Materiality, wisdom, certainty, compromise.
ru: Материальность, мудрость, уверенность, компромисс.
uk_ua: Матеріальність, мудрість, впевненість, компроміс

# Numerology.Description_9
source: Sociability, scale, versatility, variety.
ru: Коммуникабельность, масштаб, универсальность, многообразие.
uk_ua: Комунікабельність, масштаб, універсальність, різноманіття.
